# OnRPC Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IExportContext..::..OnRPC Method
IExportContext Interface See Also
---
This method marks the beginning of export of an RPC object.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
void OnRPC(
	RPCNode node
)
```

Visual Basic
---
```text
Sub OnRPC ( _
	node As RPCNode _
)
```

Visual C++
---
```text
void OnRPC(
	RPCNode^ node
)
```

# ### Parameters
node
    Type: Autodesk.Revit.DB..::..RPCNode A node with asset information about the RPC object.
# Remarks
This method is only called for photo-rendering export (a custom exporter that implements IPhotoRenderContext). When an RPC object is encountered for a model context export (a custom exporter that implements IModelExportContext), the RPC object will be provided as a polymesh (via OnPolymesh(PolymeshTopology)).
# See Also
IExportContext Interface
Autodesk.Revit.DB Namespace